vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT533S_DFP.pdsc
    <condition id="device.MIMXRT595S.internal_condition">
      <accept Dname="MIMXRT595SFAWC" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT595SFFOC" Dvendor="NXP:11"/>
    </condition>
    <condition id="component.button.condition_id">
      <require condition="allOf.anyOf=allOf=anyOf=board=evkmimxrt595, driver.lpc_gpio, component.rt_gpio_adapter, component.timer_manager, device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=anyOf=board=evkmimxrt595, driver.lpc_gpio, component.rt_gpio_adapter, component.timer_manager, device=MIMXRT533S.internal_condition">
      <require condition="anyOf.allOf=anyOf=board=evkmimxrt595, driver.lpc_gpio, component.rt_gpio_adapter.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require condition="device.MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=anyOf=board=evkmimxrt595, driver.lpc_gpio, component.rt_gpio_adapter.internal_condition">
      <accept condition="allOf.anyOf=board=evkmimxrt595, driver.lpc_gpio, component.rt_gpio_adapter.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=board=evkmimxrt595, driver.lpc_gpio, component.rt_gpio_adapter.internal_condition">
      <require condition="anyOf.board=evkmimxrt595, driver.lpc_gpio.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rt_gpio_adapter"/>
    </condition>
    <condition id="anyOf.board=evkmimxrt595, driver.lpc_gpio.internal_condition">
      <accept condition="board.evkmimxrt595.internal_condition"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
    </condition>
    <condition id="board.evkmimxrt595.internal_condition">
      <accept condition="device.MIMXRT533S.internal_condition"/>
      <accept condition="device.MIMXRT555S.internal_condition"/>
      <accept condition="device.MIMXRT595S.internal_condition"/>
    </condition>
    <condition id="component.cmsis_drivers.condition_id">
      <require condition="allOf.device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.codec_adapters.condition_id">
      <require condition="allOf.device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.codec_i2c.condition_id">
      <require condition="allOf.component.i2c_adapter_interface, device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_adapter_interface, device=MIMXRT533S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter_interface"/>
      <require condition="device.MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.cs42448_adapter.condition_id">
      <require condition="allOf.device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.cs42888_adapter.condition_id">
      <require condition="allOf.device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.ctimer_adapter.condition_id">
      <require condition="allOf.driver.ctimer, device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.ctimer, device=MIMXRT533S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer"/>
      <require condition="device.MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.da7212_adapter.condition_id">
      <require condition="allOf.device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.eeprom_AT25Fxxxx.condition_id">
      <require condition="allOf.device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.eeprom_AT45DBxxxx.condition_id">
      <require condition="allOf.device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.eeprom_InternalFlash.condition_id">
      <require condition="allOf.device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.enable_pca9544.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.enable_pca9548.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.flash_nand_flexspi.condition_id">
      <require condition="allOf.driver.flexspi, device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexspi, device=MIMXRT533S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <require condition="device.MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.flash_nor_flexspi.condition_id">
      <require condition="allOf.driver.flexspi, device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.flexcomm_i2c_adapter.condition_id">
      <require condition="allOf.component.i2c_adapter_interface, driver.flexcomm_i2c, device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_adapter_interface, driver.flexcomm_i2c, device=MIMXRT533S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter_interface"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device.MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.flexcomm_spi_adapter.condition_id">
      <require condition="allOf.driver.common, driver.flexcomm_spi, device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.flexcomm_spi, device=MIMXRT533S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require condition="device.MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.i2c_adapter_interface.condition_id">
      <require condition="allOf.anyOf=allOf=component.flexcomm_i2c_adapter, driver.flexcomm_i2c, allOf=component.i3c_adapter, driver.i3c, device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.flexcomm_i2c_adapter, driver.flexcomm_i2c, allOf=component.i3c_adapter, driver.i3c, device=MIMXRT533S.internal_condition">
      <require condition="anyOf.allOf=component.flexcomm_i2c_adapter, driver.flexcomm_i2c, allOf=component.i3c_adapter, driver.i3c.internal_condition"/>
      <require condition="device.MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.flexcomm_i2c_adapter, driver.flexcomm_i2c, allOf=component.i3c_adapter, driver.i3c.internal_condition">
      <accept condition="allOf.component.flexcomm_i2c_adapter, driver.flexcomm_i2c.internal_condition"/>
      <accept condition="allOf.component.i3c_adapter, driver.i3c.internal_condition"/>
    </condition>
    <condition id="allOf.component.flexcomm_i2c_adapter, driver.flexcomm_i2c.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm_i2c_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
    <condition id="allOf.component.i3c_adapter, driver.i3c.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c"/>
    </condition>
    <condition id="component.i2c_mux.condition_id">
      <require condition="allOf.device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.i2c_mux_pca954x.condition_id">
      <require condition="allOf.component.i2c_mux, device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_mux, device=MIMXRT533S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_mux"/>
      <require condition="device.MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.i3c_adapter.condition_id">
      <require condition="allOf.component.i2c_adapter_interface, driver.i3c, device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_adapter_interface, driver.i3c, device=MIMXRT533S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter_interface"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c"/>
      <require condition="device.MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.led.condition_id">
      <require condition="allOf.anyOf=allOf=component.lpc_gpio_adapter, driver.lpc_gpio, component.timer_manager, driver.common, device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.lpc_gpio_adapter, driver.lpc_gpio, component.timer_manager, driver.common, device=MIMXRT533S.internal_condition">
      <require condition="anyOf.allOf=component.lpc_gpio_adapter, driver.lpc_gpio.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.lpc_gpio_adapter, driver.lpc_gpio.internal_condition">
      <accept condition="allOf.component.lpc_gpio_adapter, driver.lpc_gpio.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpc_gpio_adapter, driver.lpc_gpio.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_gpio_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
    </condition>
    <condition id="component.lists.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device=MIMXRT533S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.log.condition_id">
      <require condition="allOf.driver.common, utility.str, device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, utility.str, device=MIMXRT533S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require condition="device.MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debug_console.condition_id">
      <require condition="allOf.component.log, driver.common, utility.debug_console, device=MIMXRT533S.internal_condition"/>
    </condition>
