vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT533S_DFP.pdsc
    <condition id="component.serial_manager_virtual.condition_id">
      <require condition="allOf.device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.sgtl_adapter.condition_id">
      <require condition="allOf.device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.software_crc_adapter.condition_id">
      <require condition="allOf.device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.software_rng_adapter.condition_id">
      <require condition="allOf.component.rng_adapter_interface, device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="allOf.component.rng_adapter_interface, device=MIMXRT533S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rng_adapter_interface"/>
      <require condition="device.MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.tfa9896_adapter.condition_id">
      <require condition="allOf.device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.tfa9xxx_adapter.condition_id">
      <require condition="allOf.device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.timer_manager.condition_id">
      <require condition="allOf.anyOf=allOf=component.ctimer_adapter, driver.ctimer, allOf=component.mrt_adapter, driver.mrt, allOf=component.ostimer_adapter, driver.ostimer, component.lists, driver.common, device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.ctimer_adapter, driver.ctimer, allOf=component.mrt_adapter, driver.mrt, allOf=component.ostimer_adapter, driver.ostimer, component.lists, driver.common, device=MIMXRT533S.internal_condition">
      <require condition="anyOf.allOf=component.ctimer_adapter, driver.ctimer, allOf=component.mrt_adapter, driver.mrt, allOf=component.ostimer_adapter, driver.ostimer.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.ctimer_adapter, driver.ctimer, allOf=component.mrt_adapter, driver.mrt, allOf=component.ostimer_adapter, driver.ostimer.internal_condition">
      <accept condition="allOf.component.ctimer_adapter, driver.ctimer.internal_condition"/>
      <accept condition="allOf.component.mrt_adapter, driver.mrt.internal_condition"/>
      <accept condition="allOf.component.ostimer_adapter, driver.ostimer.internal_condition"/>
    </condition>
    <condition id="allOf.component.ctimer_adapter, driver.ctimer.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer"/>
    </condition>
    <condition id="allOf.component.mrt_adapter, driver.mrt.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mrt_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mrt"/>
    </condition>
    <condition id="allOf.component.ostimer_adapter, driver.ostimer.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer"/>
    </condition>
    <condition id="component.trng_adapter.condition_id">
      <require condition="allOf.component.rng_adapter_interface, driver.trng, device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="allOf.component.rng_adapter_interface, driver.trng, device=MIMXRT533S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rng_adapter_interface"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="trng"/>
      <require condition="device.MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.usart_adapter.condition_id">
      <require condition="allOf.driver.flexcomm, driver.flexcomm_usart, device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexcomm, driver.flexcomm_usart, device=MIMXRT533S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require condition="device.MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="component.wifi_bt_module.88W8987.condition_id">
      <require condition="allOf.anyOf=component.wifi_bt_module.board_aw_cm358_usd, component.wifi_bt_module.board_aw_cm358ma, component.wifi_bt_module.board_murata_1zm_m2, component.wifi_bt_module.board_murata_1zm_usd, component.wifi_bt_module.board_ubx_jody_w2_usd, component.wifi_bt_module.config, device=MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.wifi_bt_module.board_aw_cm358_usd, component.wifi_bt_module.board_aw_cm358ma, component.wifi_bt_module.board_murata_1zm_m2, component.wifi_bt_module.board_murata_1zm_usd, component.wifi_bt_module.board_ubx_jody_w2_usd, component.wifi_bt_module.config, device=MIMXRT533S.internal_condition">
      <require condition="anyOf.component.wifi_bt_module.board_aw_cm358_usd, component.wifi_bt_module.board_aw_cm358ma, component.wifi_bt_module.board_murata_1zm_m2, component.wifi_bt_module.board_murata_1zm_usd, component.wifi_bt_module.board_ubx_jody_w2_usd.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_config"/>
      <require condition="device.MIMXRT533S.internal_condition"/>
    </condition>
    <condition id="anyOf.component.wifi_bt_module.board_aw_cm358_usd, component.wifi_bt_module.board_aw_cm358ma, component.wifi_bt_module.board_murata_1zm_m2, component.wifi_bt_module.board_murata_1zm_usd, component.wifi_bt_module.board_ubx_jody_w2_usd.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_aw_cm358_usd"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_aw_cm358ma"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_1zm_m2"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_murata_1zm_usd"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_ubx_jody_w2_usd"/>
    </condition>
    <condition id="component.wifi_bt_module.IW416.condition_id">
      <require condition="allOf.anyOf=component.wifi_bt_module.board_aw_am457_usd, component.wifi_bt_module.board_aw_am457ma, component.wifi_bt_module.board_aw_am510_arduino, component.wifi_bt_module.board_aw_am510_usd, component.wifi_bt_module.board_aw_am510ma, component.wifi_bt_module.board_murata_1xk_m2, component.wifi_bt_module.board_murata_1xk_usd, component.wifi_bt_module.board_ubx_maya_w1_usd, component.wifi_bt_module.config, device=MIMXRT533S.internal_condition"/>
    </condition>
