vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT533S_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_rd_rw61x" Cversion="1.0.0" condition="component.wifi_bt_module.board_rd_rw61x.condition_id">
      <description>RD-RW61X Wi-Fi board</description>
      <RTE_Components_h>
#ifndef WIFI_BOARD_RW610
#define WIFI_BOARD_RW610 
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_rd_rw61x_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_ubx_jody_w2_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_ubx_jody_w2_usd.condition_id">
      <description>UBX-JODY-W2-USD Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_88W8987_BOARD_UBX_JODY_W2_USD
        #define WIFI_88W8987_BOARD_UBX_JODY_W2_USD
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_ubx_jody_w2_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_ubx_jody_w5_m2" Cversion="1.0.0" condition="component.wifi_bt_module.board_ubx_jody_w5_m2.condition_id">
      <description>UBX-JODY-W5-M2 Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_AW611_BOARD_UBX_JODY_W5_M2
        #define WIFI_AW611_BOARD_UBX_JODY_W5_M2
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_ubx_jody_w5_m2_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_ubx_jody_w5_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_ubx_jody_w5_usd.condition_id">
      <description>UBX-JODY-W5-USD Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_AW611_BOARD_UBX_JODY_W5_USD
        #define WIFI_AW611_BOARD_UBX_JODY_W5_USD
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_ubx_jody_w5_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_ubx_lily_w1_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_ubx_lily_w1_usd.condition_id">
      <description>UBX-LILY-W1-USD Wi-Fi board</description>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_ubx_lily_w1_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_ubx_maya_w1_usd" Cversion="1.0.0" condition="component.wifi_bt_module.board_ubx_maya_w1_usd.condition_id">
      <description>UBX-MAYA-W1-USD Wi-Fi board</description>
      <RTE_Components_h>
        #ifndef WIFI_IW416_BOARD_UBX_MAYA_W1_USD
        #define WIFI_IW416_BOARD_UBX_MAYA_W1_USD
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.board_ubx_maya_w1_usd_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="bt_only_fw" Cversion="1.0.0" condition="component.wifi_bt_module.bt_only_fw.condition_id">
      <description>BT only firmware</description>
      <RTE_Components_h>
        #ifndef CONFIG_BT_ONLY_DNLD
        #define CONFIG_BT_ONLY_DNLD
        #endif
        #ifndef CONFIG_BT_IND_DNLD
        #define CONFIG_BT_IND_DNLD 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.bt_only_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_module_config" Cversion="1.0.0" condition="component.wifi_bt_module.config.condition_id">
      <description>Wi-Fi and BT module configs</description>
      <files>
        <file category="header" name="components/wifi_bt_module/incl/wifi_bt_module_config.h" projectpath="component/wifi_bt_module/incl"/>
        <file category="include" name="components/wifi_bt_module/incl/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nb_fw" Cversion="1.0.0" condition="component.wifi_bt_module.nb_fw.condition_id">
      <description>Narrow band firmware</description>
      <RTE_Components_h>
#ifndef CONFIG_BT_IND_DNLD
#define CONFIG_BT_IND_DNLD 1
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.nb_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tx_pwr_limits" Cversion="1.0.0" condition="component.wifi_bt_module.tx_pwr_limits.condition_id">
      <description>Wi-Fi module Tx power limits</description>
      <files>
        <file category="header" name="components/wifi_bt_module/AzureWave/tx_pwr_limits/wlan_txpwrlimit_cfg_WW.h" projectpath="component/wifi_bt_module/AzureWave/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/AzureWave/tx_pwr_limits/wlan_txpwrlimit_cfg_WW_rw610.h" projectpath="component/wifi_bt_module/AzureWave/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_1XK_WW.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_1ZM_WW.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_2EL_WW.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_NH.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/u-blox/tx_pwr_limits/wlan_txpwrlimit_cfg_jody_w5_WW.h" projectpath="component/wifi_bt_module/u-blox/tx_pwr_limits"/>
        <file category="include" name="components/wifi_bt_module/AzureWave/tx_pwr_limits/"/>
        <file category="include" name="components/wifi_bt_module/Murata/tx_pwr_limits/"/>
        <file category="include" name="components/wifi_bt_module/u-blox/tx_pwr_limits/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_combo_fw" Cversion="1.0.0" condition="component.wifi_bt_module.wifi_bt_combo_fw.condition_id">
      <description>Wi-Fi/BT combo firmware</description>
      <RTE_Components_h>
        #ifndef CONFIG_WIFI_BT_CMOBO_DNLD
        #define CONFIG_WIFI_BT_CMOBO_DNLD
        #endif
        #ifndef CONFIG_WIFI_IND_DNLD
        #define CONFIG_WIFI_IND_DNLD 0
        #endif
        #ifndef CONFIG_WIFI_IND_RESET
        #define CONFIG_WIFI_IND_RESET 0
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.wifi_bt_combo_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_fw" Cversion="1.0.0" condition="component.wifi_bt_module.wifi_fw.condition_id">
      <description>Wi-Fi firmware</description>
      <RTE_Components_h>
        #ifndef CONFIG_WIFI_IND_DNLD
        #define CONFIG_WIFI_IND_DNLD 1
        #endif
        #ifndef CONFIG_WIFI_IND_RESET
        #define CONFIG_WIFI_IND_RESET 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.wifi_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_nb_combo_fw" Cversion="1.0.0" condition="component.wifi_bt_module.wifi_nb_combo_fw.condition_id">
      <description>wifi_nb_combo firmware</description>
      <RTE_Components_h>
        #ifndef CONFIG_WIFI_IND_DNLD
        #define CONFIG_WIFI_IND_DNLD 0
        #endif
        #ifndef CONFIG_WIFI_IND_RESET
        #define CONFIG_WIFI_IND_RESET 0
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.wifi_nb_combo_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8524_adapter" Cversion="2.2.0" condition="component.wm8524_adapter.condition_id">
      <description>Component wm8524 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.h" projectpath="codec/port/wm8524"/>
        <file category="sourceC" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.c" projectpath="codec/port/wm8524"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8524/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter" Cversion="2.2.0" condition="component.wm8904_adapter.condition_id">
      <description>Component wm8904 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.h" projectpath="codec/port/wm8904"/>
        <file category="sourceC" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.c" projectpath="codec/port/wm8904"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8904/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter" Cversion="2.2.0" condition="component.wm8960_adapter.condition_id">
      <description>Component wm8960 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.h" projectpath="codec/port/wm8960"/>
        <file category="sourceC" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.c" projectpath="codec/port/wm8960"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8960/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962_adapter" Cversion="2.2.0" condition="component.wm8962_adapter.condition_id">
      <description>Component wm8962 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.h" projectpath="codec/port/wm8962"/>
        <file category="sourceC" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.c" projectpath="codec/port/wm8962"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8962/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT533S_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MIMXRT533S_cmsis</description>
      <files>
        <file category="header" name="devices/MIMXRT533S/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT533S/MIMXRT533S.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT533S/MIMXRT533S_features.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT533S/MIMXRT533S_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_ADC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_AHB_SECURE_CTRL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_AXI_SWITCH_AMIB.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_AXI_SWITCH_ASIB.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_CACHE64_CTRL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_CACHE64_POLSEL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_CASPER.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_CLKCTL0.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_CLKCTL1.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_CMP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_CRC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_CTIMER.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_DEBUGGER_MAILBOX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_DMA.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_DMIC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_FLEXCOMM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_FLEXIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_FLEXSPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_FREQME.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_GPIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_HASHCRYPT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_I2C.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_I2S.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_I3C.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_INPUTMUX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_IOPCTL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_LCDIF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_MIPI_DSI_HOST.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_MRT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_MU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_OCOTP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_OSTIMER.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_OTFAD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_PINT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_PMC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_POWERQUAD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_PUF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_ROMCP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_RSTCTL0.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_RSTCTL1.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_RTC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_SCT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_SEMA42.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_SPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_SYSCTL0.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_SYSCTL1.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_TRNG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_USART.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_USBHSD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_USBHSDCD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_USBHSH.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_USBPHY.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_USDHC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_UTICK.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT533S/periph/PERI_WWDT.h" projectpath="device/periph"/>
        <file category="include" name="devices/MIMXRT533S/"/>
        <file category="include" name="devices/MIMXRT533S/periph/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT533S/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MIMXRT533S/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MIMXRT533S_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MIMXRT533S_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33, device_ids=MIMXRT533S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT533S/arm/MIMXRT533Sxxxx_ram.scf" version="1.0.0" projectpath="MIMXRT533S/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, core_ids=cm33, device_ids=MIMXRT533S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT533S/arm/MIMXRT533Sxxxx_flash.scf" version="1.0.0" projectpath="MIMXRT533S/arm"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33, device_ids=MIMXRT533S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT533S/gcc/MIMXRT533Sxxxx_ram.ld" version="1.0.0" projectpath="MIMXRT533S/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, core_ids=cm33, device_ids=MIMXRT533S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT533S/gcc/MIMXRT533Sxxxx_flash.ld" version="1.0.0" projectpath="MIMXRT533S/gcc"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33, device_ids=MIMXRT533S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT533S/iar/MIMXRT533Sxxxx_ram.icf" version="1.0.0" projectpath="MIMXRT533S/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, core_ids=cm33, device_ids=MIMXRT533S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT533S/iar/MIMXRT533Sxxxx_flash.icf" version="1.0.0" projectpath="MIMXRT533S/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MIMXRT533S" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MIMXRT533S</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT533S/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT533S/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT533S/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT533S/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT533S/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT533S/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT533S/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT533S/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MIMXRT533S/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MIMXRT533S_startup</description>
      <files>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT533S/iar/startup_MIMXRT533S.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT533S/gcc/startup_MIMXRT533S.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT533S/arm/startup_MIMXRT533S.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
