vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT533S_DFP.pdsc
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT533S_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MIMXRT533S_system</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT533S/system_MIMXRT533S.c" projectpath="device"/>
        <file category="header" name="devices/MIMXRT533S/system_MIMXRT533S.h" projectpath="device"/>
        <file category="include" name="devices/MIMXRT533S/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="acmp" Cversion="2.3.0" condition="driver.acmp.condition_id">
      <description>ACMP Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT533S/drivers/fsl_acmp.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT533S/drivers/fsl_acmp.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT533S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497" Cversion="2.1.2" condition="driver.ak4497.condition_id">
      <description>Driver ak4497</description>
      <RTE_Components_h>
#ifndef CODEC_AK4497_ENABLE
#define CODEC_AK4497_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/ak4497/fsl_ak4497.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/ak4497/fsl_ak4497.c" projectpath="codec"/>
        <file category="include" name="components/codec/ak4497/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cache_cache64" Cversion="2.0.11" condition="driver.cache_cache64.condition_id">
      <description>CACHE Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT533S/drivers/fsl_cache.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT533S/drivers/fsl_cache.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT533S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-common" Cversion="1.0.0" condition="driver.camera-common.condition_id">
      <description>Driver camera-common</description>
      <files>
        <file category="header" name="components/video/camera/fsl_camera.h" projectpath="video"/>
        <file category="include" name="components/video/camera/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-ap1302" Cversion="1.0.1" condition="driver.camera-device-ap1302.condition_id">
      <description>Driver camera-device-ap1302</description>
      <files>
        <file category="header" name="components/video/camera/device/ap1302/fsl_ap1302.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/ap1302/fsl_ap1302.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/ap1302/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-common" Cversion="1.0.0" condition="driver.camera-device-common.condition_id">
      <description>Driver camera-device-common</description>
      <files>
        <file category="header" name="components/video/camera/device/fsl_camera_device.h" projectpath="video"/>
        <file category="include" name="components/video/camera/device/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-max9286" Cversion="1.0.2" condition="driver.camera-device-max9286.condition_id">
      <description>Driver camera-device-max9286</description>
      <files>
        <file category="header" name="components/video/camera/device/max9286/fsl_max9286.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/max9286/fsl_max9286.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/max9286/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-mt9m114" Cversion="1.0.2" condition="driver.camera-device-mt9m114.condition_id">
      <description>Driver camera-device-mt9m114</description>
      <files>
        <file category="header" name="components/video/camera/device/mt9m114/fsl_mt9m114.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/mt9m114/fsl_mt9m114.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/mt9m114/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-ov5640" Cversion="1.0.1" condition="driver.camera-device-ov5640.condition_id">
      <description>Driver camera-device-ov5640</description>
      <files>
        <file category="header" name="components/video/camera/device/ov5640/fsl_ov5640.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/ov5640/fsl_ov5640.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/ov5640/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-ov7670" Cversion="1.0.2" condition="driver.camera-device-ov7670.condition_id">
      <description>Driver camera-device-ov7670</description>
      <files>
        <file category="header" name="components/video/camera/device/ov7670/fsl_ov7670.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/ov7670/fsl_ov7670.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/ov7670/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-ov7725" Cversion="1.0.1" condition="driver.camera-device-ov7725.condition_id">
      <description>Driver camera-device-ov7725</description>
      <files>
        <file category="header" name="components/video/camera/device/ov7725/fsl_ov7725.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/ov7725/fsl_ov7725.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/ov7725/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-sccb" Cversion="1.0.1" condition="driver.camera-device-sccb.condition_id">
      <description>Driver camera-device-sccb</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/video/camera/device/sccb/fsl_sccb.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/sccb/fsl_sccb.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/sccb/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-receiver-common" Cversion="1.0.0" condition="driver.camera-receiver-common.condition_id">
      <description>Driver camera-receiver-common</description>
      <files>
        <file category="header" name="components/video/camera/receiver/fsl_camera_receiver.h" projectpath="video"/>
        <file category="include" name="components/video/camera/receiver/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="casper" Cversion="2.2.4" condition="driver.casper.condition_id">
      <description>CASPER Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT533S/drivers/fsl_casper.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT533S/drivers/fsl_casper.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT533S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.7.1" condition="driver.clock.condition_id">
      <description>Clock Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT533S/drivers/fsl_clock.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT533S/drivers/fsl_clock.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT533S/drivers/"/>
      </files>
    </component>
